# Brew
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'cmake'
brew 'readline'
brew 'ack'
brew 'ag'

brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

brew 'neovim'

brew 'postgresql'
brew 'git'
brew 'htop'
brew 'wget'
brew 'masscan'
brew 'nmap'
brew 'mitmproxy'
brew 'ssh-copy-id'

brew 'rbenv'
brew 'ruby-build'

brew 'nodenv'
brew 'node-build'
brew 'yarn'

brew 'fzf'
brew 'autojump'

brew 'phantomjs'

brew 'webp'
brew 'gifsicle'
brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-x264', 'without-xvid']
brew 'librsvg'
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'jpeg'
brew 'libtiff'

tap 'puma/puma'
brew 'puma/puma/puma-dev'

brew 'erlang'
brew 'elixir'

# brew 'install kafka'
# brew services start kafka
# brew services start zookeeper

# MAS
brew 'mas'

mas 'Be Focused Pro - Focus Timer & Goal Tracker', id: 961632517
mas 'Shush - Microphone Manager', id: 496437906
mas 'Call Recorder - Skype Edition', id: 909323225
mas 'Todoist: Organize your life', id: 585829637
mas 'WhatsApp Desktop', id: 1147396723
mas 'Evernote', id: 406056744
mas 'Record It-Screen Recorder', id: 1339001002
mas 'Slack', id: 803453959

# CASK
tap 'caskroom/cask'
brew 'brew-cask-completion'

cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'pritunl'
cask 'dash'
cask 'postman'
cask 'spotify'
cask 'recordit'
